# GetSourceElementOriginalCategoryIds Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
Part..::..GetSourceElementOriginalCategoryIds Method
Part Class See Also
---
Gets the category ids of the source elements which were used to form this part.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2013
# Syntax
C#
---
```text
public ICollection<ElementId> GetSourceElementOriginalCategoryIds()
```

Visual Basic
---
```text
Public Function GetSourceElementOriginalCategoryIds As ICollection(Of ElementId)
```

Visual C++
---
```text
public:
ICollection<ElementId^>^ GetSourceElementOriginalCategoryIds()
```

# ### Return Value
The category ids.
# See Also
Part Class
Autodesk.Revit.DB Namespace